# Pandas Essentials - Practical Excercises

    1. Series and DataFrame Basics
    2. Indexing and Selection
    3. Handling missing data
    4. Data Types and Column Operations
    5. Sorting and Ranking
    6. Apply, Map and Vectorized Operations
    7. GroupBy Operations
    8. Merge, Join & Concat
    9. String Operations
    10. Data & Time Basics
    11. File Handling

### Series and DataFrame Basics

    what is pandas and when to use it
    Series vs DataFrame
    Creating DataFrames - from dictionary, from list of dictionaries
    head(), tail(), info(), describe()
    index

In [1]:
import pandas as pd
import numpy as np

    Pandas ------> Powerful Python Data Analysis Toolkit
                   Python Package
                   fast, flexible, expressive data structure design
           ----->  Easy handling of missing data
                   Size mutable/columns can be added or removed
                   auto and explicit data alignment , labeling
                   easy to convert data from other Python form
                   intelligent label based slicing, indexing, subsetting 
                   intuitive merging and joining datasets 
                   flexible reshaping and pivoting
                   hierarchial labelling of axes
                   robust i/o tools
                   time series functionality

    Series vs DataFrames
    Series - 1D array with axis labels
    Dataframes - 2D size mutable heterogenous tabular data

#### Creating Series

#### from numpy array

In [2]:
import pandas as pd
import numpy as np

data = np.array(['g', 'e', 'e', 'k', 's'])

ser = pd.Series(data)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

#### from list

In [3]:
import pandas as pd

data_list = ['g', 'e', 'e', 'k', 's']

ser = pd.Series(data_list)
print(ser)

0    g
1    e
2    e
3    k
4    s
dtype: object

#### from dictionary

In [4]:
import pandas as pd

data_dict = {'Geeks': 10, 'for': 20, 'geeks': 30}

ser = pd.Series(data_dict)
print(ser)

Geeks    10
for      20
geeks    30
dtype: int64

#### from numpy functions

In [5]:
import numpy as np
import pandas as pd

ser = pd.Series(np.linspace(1, 10, 5))
print(ser)

0     1.00
1     3.25
2     5.50
3     7.75
4    10.00
dtype: float64

In [6]:
import pandas as pd
ser=pd.Series(range(1,20,3), index=[x for x in 'abcdefg'])
print(ser)

a     1
b     4
c     7
d    10
e    13
f    16
g    19
dtype: int64

#### Creating Dataframe from dictionary (from_dict), series, array (pd.dataframe) and from list of dictionaries

    From Dictionary → Keys become column names, values become column data.
    From List of Lists → Provide columns parameter for column names.
    From List of Dictionaries → Each dictionary is a row.
    From NumPy Array → Works well for numeric or mixed data.
    Empty DataFrame → Useful for appending data later.

#### Creating a DataFrame from dictionary

In [7]:
data = {"col_1": [3, 2, 1, 0], "col_2": ["a", "b", "c", "d"]}
pd.DataFrame.from_dict(data)

   col_1 col_2
0      3     a
1      2     b
2      1     c
3      0     d

In [8]:
data = {
    "index": [("a", "b"), ("a", "c")],
    "columns": [("x", 1), ("y", 2)],
    "data": [[1, 3], [2, 4]],
    "index_names": ["n1", "n2"],
    "column_names": ["z1", "z2"],
}
pd.DataFrame.from_dict(data)

    index columns    data index_names column_names
0  (a, b)  (x, 1)  [1, 3]          n1           z1
1  (a, c)  (y, 2)  [2, 4]          n2           z2

#### Creating a DataFrame from numpy array

In [9]:
columns = ["A", "B", "C"]
rows = ["D", "E", "F"]
data = np.array([[1, 2, 2], [3, 3, 3],[4, 4, 4]])
df = pd.DataFrame(data=data, index=rows, columns=columns)
df

   A  B  C
D  1  2  2
E  3  3  3
F  4  4  4

#### Create DataFrame from List of Dictionaries

In [10]:
import pandas as pd

# Initialize data to lists.
data = [{'a': 1, 'b': 2, 'c': 3},
        {'a': 10, 'b': 20, 'c': 30}]

# Creates DataFrame.
df = pd.DataFrame(data)

print(df)

    a   b   c
0   1   2   3
1  10  20  30

#### Creating a DataFrame from Another DataFrame

In [11]:
original_df = pd.DataFrame({
    'Name': ['Tom', 'Nick', 'Krish', 'Jack'],
    'Age': [20, 21, 19, 18]
})

new_df = original_df[['Name']] 
print(new_df)

    Name
0    Tom
1   Nick
2  Krish
3   Jack

#### Create DataFrame from a Dictionary of Series

In [12]:
import pandas as pd

# Initialize data to Dicts of series.
d = {'one': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd']),
     'two': pd.Series([10, 20, 30, 40],
                      index=['a', 'b', 'c', 'd'])}

# creates Dataframe.
df = pd.DataFrame(d)

print(df)

   one  two
a   10   10
b   20   20
c   30   30
d   40   40

In [13]:
# importing pandas library
import pandas as pd

# Creating a list
author = ['Jitender', 'Purnima', 
          'Arpit', 'Jyoti']
# Creating a Series by passing list 
# variable to Series() function
auth_series = pd.Series(author)
article = [210, 211, 114, 178]

# Creating two Series by passing lists
auth_series = pd.Series(author)
article_series = pd.Series(article)

# Creating a dictionary by passing Series objects as values
frame = {'Author': auth_series,
         'Article': article_series}

# Creating DataFrame by passing Dictionary
result = pd.DataFrame(frame)

# Printing elements of Dataframe
print(result)

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178

In [14]:
import pandas as pd
names = ["Aparna", "Pankaj", "Sudhir", "Garvit"]
degrees = ["MBA", "BCA", "MTech", "MBA"]
scores = [90, 40, 80, 98]

df = pd.DataFrame({'Name': names, 'Degree': degrees, 'Score': scores})
print(df)

     Name Degree  Score
0  Aparna    MBA     90
1  Pankaj    BCA     40
2  Sudhir  MTech     80
3  Garvit    MBA     98

#### DataFrame fields analysis

    head()     - displays first n rows of the DataFrame
    tail()     - displays last n rows of the DataFrame
    info()     - prints information about a DataFrame including the index dtype and columns, non-NA values and memory usage
    describe() - Descriptive statistics include those that summarize the central tendency, 
                dispersion and shape of a dataset’s distribution
    shape      - property of a DataFrame returns a tuple representing its dimensions (rows,columns)
    columns    - used to access the column labels of a DataFrame
    index      - set the index of df or display the current index.

In [15]:
df = pd.DataFrame(
    {
        "animal": [
            "alligator",
            "bee",
            "falcon",
            "lion",
            "monkey",
            "parrot",
            "shark",
            "whale",
            "zebra",
        ]
    }
)
df

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot
6      shark
7      whale
8      zebra

In [16]:
df.head()

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey

In [17]:
df.head(2)

      animal
0  alligator
1        bee

In [18]:
df.head(-3)

      animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot

In [19]:
df.tail(3)

  animal
6  shark
7  whale
8  zebra

In [20]:
df.tail(-3)

   animal
3    lion
4  monkey
5  parrot
6   shark
7   whale
8   zebra

In [21]:
df.info

<bound method DataFrame.info of       animal
0  alligator
1        bee
2     falcon
3       lion
4     monkey
5     parrot
6      shark
7      whale
8      zebra>

In [22]:
random_strings_array = np.random.choice(["a", "b", "c"], 10**6)
df = pd.DataFrame(
    {
        "column_1": np.random.choice(["a", "b", "c"], 10**6),
        "column_2": np.random.choice(["a", "b", "c"], 10**6),
        "column_3": np.random.choice(["a", "b", "c"], 10**6),
    }
)
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000000 entries, 0 to 999999
Data columns (total 3 columns):
 #   Column    Non-Null Count    Dtype
---  ------    --------------    -----
 0   column_1  1000000 non-null  object
 1   column_2  1000000 non-null  object
 2   column_3  1000000 non-null  object
dtypes: object(3)
memory usage: 22.9+ MB

In [23]:
df.describe()

       column_1 column_2 column_3
count   1000000  1000000  1000000
unique        3        3        3
top           b        c        c
freq     333926   333687   333694

In [24]:
df1 = pd.DataFrame({'Name': ['Alice', 'Bob', 'Aritra'],
                   'Age': [25, 30, 35],
                   'Location': ['Seattle', 'New York', 'Kona']},
                  index=([10, 20, 30]))
df1.index

Int64Index([10, 20, 30], dtype='int64')

    index - The index of a DataFrame is a series of labels that identify each row. 
    The labels can be integers, strings, or any other hashable type

In [25]:
df1.index = [100, 200, 300]
df1

       Name  Age  Location
100   Alice   25   Seattle
200     Bob   30  New York
300  Aritra   35      Kona

In [26]:
df.shape

(1000000, 3)

In [27]:
df.shape[0]                       #df.shape[0] → Number of rows

1000000

In [28]:
df.shape[1]                       #df.shape[1] → Number of columns

3

In [29]:
df1.columns                     #df.shape[1] → Number of columns

Index(['Name', 'Age', 'Location'], dtype='object')

In [30]:
df1.index

Int64Index([100, 200, 300], dtype='int64')

### Indexing and Selection

    Column Selection
    Row Selection
    loc vs iloc
    Filtering with conditions
    Multiple conditions (&, |)

    Key Methods

    iloc → Select by integer position (row number).
    loc → Select by label/index name.
    Boolean indexing → Filter rows based on conditions.
    isin() → Filter rows where a column matches any value in a list.
    ~ → Negates a condition (NOT).

    The main distinction between the two methods is:
        loc gets rows (and/or columns) with particular labels.
        iloc gets rows (and/or columns) at integer locations.

In [31]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 35, 40],
    'City': ['New York', 'London', 'Paris', 'Tokyo']
}
df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

#Select a single column (returns a Series)
name_col = df['Name']
print("\nSingle column (Series):")
print(name_col)

#Select multiple columns (returns a DataFrame)
name_age_cols = df[['Name', 'Age']]
print("\nMultiple columns (DataFrame):")
print(name_age_cols)

#Select columns by position using iloc
first_two_cols = df.iloc[:, 0:2]  # columns 0 and 1
print("\nFirst two columns using iloc:")
print(first_two_cols)

#Select columns by label using loc
city_col = df.loc[:, 'City']
print("\nCity column using loc:")
print(city_col)

#Conditional column selection (example: select columns with numeric dtype)
numeric_cols = df.select_dtypes(include='number')
print("\nNumeric columns only:")
print(numeric_cols)

Original DataFrame:
      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35     Paris
3    David   40     Tokyo

Single column (Series):
0      Alice
1        Bob
2    Charlie
3      David
Name: Name, dtype: object

Multiple columns (DataFrame):
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

First two columns using iloc:
      Name  Age
0    Alice   25
1      Bob   30
2  Charlie   35
3    David   40

City column using loc:
0    New York
1      London
2       Paris
3       Tokyo
Name: City, dtype: object

Numeric columns only:
   Age
0   25
1   30
2   35
3   40

In [32]:
import pandas as pd

# Sample DataFrame
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eva'],
    'Age': [25, 30, 35, 40, 45],
    'City': ['New York', 'London', 'London', 'Paris', 'New York']
}
df = pd.DataFrame(data)

print("Original DataFrame:")
print(df)

#Select rows by index position using iloc
print("\nRow at index 2:")
print(df.iloc[2])  # Single row
print("\nRows at index 1 to 3:")
print(df.iloc[1:4])  # Slice of rows

#Select rows by label using loc
print("\nRow with index label 0:")
print(df.loc[0])
print("\nRows with index labels 0 and 3:")
print(df.loc[[0, 3]])

#Select rows based on a single condition
print("\nRows where Age > 30:")
print(df[df['Age'] > 30])

#Select rows based on multiple conditions
print("\nRows where Age > 30 and City is London:")
print(df[(df['Age'] > 30) & (df['City'] == 'London')])

#Select rows where column value is in a list
print("\nRows where City is either London or Paris:")
print(df[df['City'].isin(['London', 'Paris'])])

#Select rows where column value is NOT in a list
print("\nRows where City is NOT London:")
print(df[~df['City'].isin(['London'])])

#Select rows by index values
print("\nRows with index 0 and 4:")
print(df.loc[[0, 4]])

Original DataFrame:
      Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35    London
3    David   40     Paris
4      Eva   45  New York

Row at index 2:
Name    Charlie
Age          35
City     London
Name: 2, dtype: object

Rows at index 1 to 3:
      Name  Age    City
1      Bob   30  London
2  Charlie   35  London
3    David   40   Paris

Row with index label 0:
Name       Alice
Age           25
City    New York
Name: 0, dtype: object

Rows with index labels 0 and 3:
    Name  Age      City
0  Alice   25  New York
3  David   40     Paris

Rows where Age > 30:
      Name  Age      City
2  Charlie   35    London
3    David   40     Paris
4      Eva   45  New York

Rows where Age > 30 and City is London:
      Name  Age    City
2  Charlie   35  London

Rows where City is either London or Paris:
      Name  Age    City
1      Bob   30  London
2  Charlie   35  London
3    David   40   Paris

Rows where City is NOT London:
    Name  Age      City
0  Alice   25  New York
3  David   40     Paris
4    Eva   45  New York

Rows with index 0 and 4:
    Name  Age      City
0  Alice   25  New York
4    Eva   45  New York

In [33]:
df.dtypes               #Return the dtypes in the DataFrame

Name    object
Age      int64
City    object
dtype: object

In [34]:
df.values                  #Return a Numpy representation of the DataFrame

array([['Alice', 25, 'New York'],
       ['Bob', 30, 'London'],
       ['Charlie', 35, 'London'],
       ['David', 40, 'Paris'],
       ['Eva', 45, 'New York']], dtype=object)

In [35]:
df.ndim                #Return an int representing the number of axes / array dimensions

2

In [36]:
df.columns

Index(['Name', 'Age', 'City'], dtype='object')

In [37]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [38]:
df.keys

<bound method NDFrame.keys of       Name  Age      City
0    Alice   25  New York
1      Bob   30    London
2  Charlie   35    London
3    David   40     Paris
4      Eva   45  New York>

### Data Cleaning  - Handling missing data

    Handling missing values
    isna(), fillna(), dropna()
    Renaming columns - rename()
    Changing data types - astype()
    Removing duplicates - drop_duplicates()

In [39]:
#Inserting missing data
ser = pd.Series([1., 2., 3.])
ser.loc[0] = None
ser

0    NaN
1    2.0
2    3.0
dtype: float64

In [40]:
#Determine missing values - isna()
ser = pd.Series([5, 6, np.nan])
ser

0    5.0
1    6.0
2    NaN
dtype: float64

In [41]:
ser.isna()

0    False
1    False
2     True
dtype: bool

In [42]:
ser.notna()

0     True
1     True
2    False
dtype: bool

In [43]:
#Dropping missing data - dropna()
df = pd.DataFrame([[np.nan, 1, 2], [1, 2, np.nan], [1, 2, 3]])
df

     0  1    2
0  NaN  1  2.0
1  1.0  2  NaN
2  1.0  2  3.0

In [44]:
df.dropna()

     0  1    2
2  1.0  2  3.0

In [45]:
df.dropna(axis=1)

   1
0  1
1  2
2  2

In [46]:
#Filling by value - fillna()
data = {"np": [1.0, np.nan, np.nan, 2], "arrow": pd.array([1.0, pd.NA, pd.NA, 2])}
df = pd.DataFrame(data)
df

    np  arrow
0  1.0    1.0
1  NaN   <NA>
2  NaN   <NA>
3  2.0    2.0

In [47]:
df.fillna(0)

    np  arrow
0  1.0    1.0
1  0.0    0.0
2  0.0    0.0
3  2.0    2.0

#### Renaming columns

In [48]:
df = pd.DataFrame({"A": [1, 2, 3], "B": [4, 5, 6]})
df.rename(columns={"A": "a", "B": "c"})

   a  c
0  1  4
1  2  5
2  3  6

In [49]:
df.rename(index={0: "x", 1: "y", 2: "z"})

   A  B
x  1  4
y  2  5
z  3  6

In [50]:
df.rename(str.lower, axis="columns")

   a  b
0  1  4
1  2  5
2  3  6

In [51]:
df.rename({1: 2, 2: 4}, axis="index")

   A  B
0  1  4
2  2  5
4  3  6

In [52]:
d = {"col1": [1, 2], "col2": [3, 4]}
df = pd.DataFrame(data=d)
df.dtypes

col1    int64
col2    int64
dtype: object

In [53]:
df.astype("int32").dtypes

col1    int32
col2    int32
dtype: object

In [54]:
df.astype({"col1": "int32"}).dtypes

col1    int32
col2    int64
dtype: object

In [55]:
ser = pd.Series([1, 2], dtype="int32")

In [56]:
ser.astype("category")

0    1
1    2
dtype: category
Categories (2, int64): [1, 2]

In [57]:
df = pd.DataFrame(
    {
        "brand": ["Yum Yum", "Yum Yum", "Indomie", "Indomie", "Indomie"],
        "style": ["cup", "cup", "cup", "pack", "pack"],
        "rating": [4, 4, 3.5, 15, 5],
    }
)
df

     brand style  rating
0  Yum Yum   cup     4.0
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [58]:
df.drop_duplicates()                #By default, it removes duplicate rows based on all columns.

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5
3  Indomie  pack    15.0
4  Indomie  pack     5.0

In [59]:
df.drop_duplicates(subset=["brand"])    #To remove duplicates on specific column(s), use subset

     brand style  rating
0  Yum Yum   cup     4.0
2  Indomie   cup     3.5

In [60]:
df.drop_duplicates(subset=["brand", "style"], keep="last")  #To remove duplicates and keep last occurrences, use keep

     brand style  rating
1  Yum Yum   cup     4.0
2  Indomie   cup     3.5
4  Indomie  pack     5.0

### Sorting and Ranking

    sort_values()
    sort_index()
    Ranking Basics

In [61]:
import numpy as np
import pandas as pd
df = pd.DataFrame(
    {
        "col1": ["A", "A", "B", np.nan, "D", "C"],
        "col2": [2, 1, 9, 8, 7, 4],
        "col3": [0, 1, 9, 4, 2, 3],
        "col4": ["a", "B", "c", "D", "e", "F"],
    }
)
df

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

#### Sort by single column

In [62]:
df.sort_values(by=["col1"])

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

#### Sort by multiple columns

In [63]:
df.sort_values(by=["col1", "col2"])

  col1  col2  col3 col4
1    A     1     1    B
0    A     2     0    a
2    B     9     9    c
5    C     4     3    F
4    D     7     2    e
3  NaN     8     4    D

#### Sort in descending order

In [64]:
df.sort_values(by="col1", ascending=False)

  col1  col2  col3 col4
4    D     7     2    e
5    C     4     3    F
2    B     9     9    c
0    A     2     0    a
1    A     1     1    B
3  NaN     8     4    D

#### Customized sort order

In [65]:
df.sort_values(by="col4", key=lambda col: col.str.lower())

  col1  col2  col3 col4
0    A     2     0    a
1    A     1     1    B
2    B     9     9    c
3  NaN     8     4    D
4    D     7     2    e
5    C     4     3    F

In [66]:
df = pd.DataFrame(
    [1, 2, 3, 4, 5], index=[100, 29, 234, 1, 150], columns=["A"]
)
df.sort_index()

     A
1    4
29   2
100  1
150  5
234  3

In [67]:
df.sort_index(ascending=False)

     A
234  3
150  5
100  1
29   2
1    4

In [68]:
df = pd.DataFrame({"a": [1, 2, 3, 4]}, index=["A", "b", "C", "d"])
df.sort_index(key=lambda x: x.str.lower())

   a
A  1
b  2
C  3
d  4

In [69]:
df = pd.DataFrame(
    data={
        "Animal": ["cat", "penguin", "dog", "spider", "snake"],
        "Number_legs": [4, 2, 4, 8, np.nan],
    }
)
df

    Animal  Number_legs
0      cat          4.0
1  penguin          2.0
2      dog          4.0
3   spider          8.0
4    snake          NaN

In [70]:
df.rank()

   Animal  Number_legs
0     1.0          2.5
1     3.0          1.0
2     2.0          2.5
3     5.0          4.0
4     4.0          NaN

In [71]:
s = pd.Series(range(5), index=list("abcde"))
s["d"] = s["b"]
s.rank()

a    1.0
b    2.5
c    4.0
d    2.5
e    5.0
dtype: float64

In [72]:
df["default_rank"] = df["Number_legs"].rank()                        #default behaviour obtained
df["max_rank"] = df["Number_legs"].rank(method="max")                #records that have the same values ranked using highest rank
df["NA_bottom"] = df["Number_legs"].rank(na_option="bottom")         #records with NaN values are placed at the bottom of the ranking
df["pct_rank"] = df["Number_legs"].rank(pct=True)                    #ranking is expressed as percentile
df

    Animal  Number_legs  default_rank  max_rank  NA_bottom  pct_rank
0      cat          4.0           2.5       3.0        2.5     0.625
1  penguin          2.0           1.0       1.0        1.0     0.250
2      dog          4.0           2.5       3.0        2.5     0.625
3   spider          8.0           4.0       4.0        4.0     1.000
4    snake          NaN           NaN       NaN        5.0       NaN

### Apply, Map and Vectorized Operations

    apply() ---> row and columns level
    Lamda functions
    Creating new columns
    String Operations(str)

#### apply() function
    0 or ‘index’: apply function to each column.
    1 or ‘columns’: apply function to each row.

In [73]:
df = pd.DataFrame([[4, 9]] * 3, columns=["A", "B"])
df

   A  B
0  4  9
1  4  9
2  4  9

In [74]:
df.apply(np.sqrt)

     A    B
0  2.0  3.0
1  2.0  3.0
2  2.0  3.0

In [75]:
df.apply(np.sum, axis=0)

A    12
B    27
dtype: int64

In [76]:
df.apply(np.sum, axis=1)

0    13
1    13
2    13
dtype: int64

#### lamda() function
    DataFrame.apply(lambda x: expression, axis=0 or 1)
    axis=0 → Apply function to each column (default).
    axis=1 → Apply function to each row.

#### Dataframe.assign() on a Single Column

In [77]:
# importing pandas library
import pandas as pd
 
# creating and initializing a list
values= [['Rohan',455],['Elvish',250],['Deepak',495],
         ['Soni',400],['Radhika',350],['Vansh',450]] 

# creating a pandas dataframe
df = pd.DataFrame(values,columns=['Name','Total_Marks'])

# Applying lambda function to find 
# percentage of 'Total_Marks' column 
# using df.assign()
df = df.assign(Percentage = lambda x: (x['Total_Marks'] /500 * 100))

# displaying the data frame
df

      Name  Total_Marks  Percentage
0    Rohan          455        91.0
1   Elvish          250        50.0
2   Deepak          495        99.0
3     Soni          400        80.0
4  Radhika          350        70.0
5    Vansh          450        90.0

#### Dataframe.assign() on Multiple Columns

In [78]:
# importing pandas library
import pandas as pd

# creating and initializing a nested list
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80],
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90],
               [51, 2.3, 111]]

# creating a pandas dataframe
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3'])

# Applying lambda function to find
# the product of 3 columns using
# df.assign()
df = df.assign(Product=lambda x: (x['Field_1'] * x['Field_2'] * x['Field_3']))

# printing dataframe
df

   Field_1  Field_2  Field_3  Product
0       15      2.5      100   3750.0
1       20      4.5       50   4500.0
2       25      5.2       80  10400.0
3       45      5.8       48  12528.0
4       40      6.3       70  17640.0
5       41      6.4       90  23616.0
6       51      2.3      111  13020.3

#### Dataframe.apply() on a Single Row

In [79]:
# importing pandas and numpy libraries
import pandas as pd
import numpy as np

# creating and initializing a nested list
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80],
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90], 
               [51, 2.3, 111]]

# creating a pandas dataframe
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3'],
                  index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])


# Apply function numpy.square() to square
# the values of one row only i.e. row 
# with index name 'd'
df = df.apply(lambda x: np.square(x) if x.name == 'd' else x, axis=1)


# printing dataframe
df

   Field_1  Field_2  Field_3
a     15.0     2.50    100.0
b     20.0     4.50     50.0
c     25.0     5.20     80.0
d   2025.0    33.64   2304.0
e     40.0     6.30     70.0
f     41.0     6.40     90.0
g     51.0     2.30    111.0

#### Dataframe.apply() on Multiple Rows

In [80]:
# importing pandas and numpylibraries
import pandas as pd
import numpy as np

# creating and initializing a nested list
values_list = [[15, 2.5, 100], [20, 4.5, 50], [25, 5.2, 80],
               [45, 5.8, 48], [40, 6.3, 70], [41, 6.4, 90],
               [51, 2.3, 111]]

# creating a pandas dataframe
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3'],
                  index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])


# Apply function numpy.square() to square 
# the values of 3 rows only i.e. with row
# index name 'a', 'e' and 'g' only
df = df.apply(lambda x: np.square(x) if x.name in [
              'a', 'e', 'g'] else x, axis=1)

# printing dataframe
df

   Field_1  Field_2  Field_3
a    225.0     6.25  10000.0
b     20.0     4.50     50.0
c     25.0     5.20     80.0
d     45.0     5.80     48.0
e   1600.0    39.69   4900.0
f     41.0     6.40     90.0
g   2601.0     5.29  12321.0

#### Lambda Function on Multiple Rows and Columns Simultaneously
    Also creating a new column from that

In [81]:
# importing pandas and numpylibraries
import pandas as pd
import numpy as np

# creating and initializing a nested list
values_list = [[1.5, 2.5, 10.0], [2.0, 4.5, 5.0], [2.5, 5.2, 8.0],
               [4.5, 5.8, 4.8], [4.0, 6.3, 70], [4.1, 6.4, 9.0],
               [5.1, 2.3, 11.1]]

# creating a pandas dataframe
df = pd.DataFrame(values_list, columns=['Field_1', 'Field_2', 'Field_3'],
                  index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])


# Apply function numpy.square() to square 
# the values of 2 rows only i.e. with row
# index name 'b' and 'f' only
df = df.apply(lambda x: np.square(x) if x.name in ['b', 'f'] else x, axis=1)

# Applying lambda function to find product of 3 columns
# i.e 'Field_1', 'Field_2' and 'Field_3'
df = df.assign(Product=lambda x: (x['Field_1'] * x['Field_2'] * x['Field_3']))


# printing dataframe
df

   Field_1  Field_2  Field_3     Product
a     1.50     2.50     10.0     37.5000
b     4.00    20.25     25.0   2025.0000
c     2.50     5.20      8.0    104.0000
d     4.50     5.80      4.8    125.2800
e     4.00     6.30     70.0   1764.0000
f    16.81    40.96     81.0  55771.5456
g     5.10     2.30     11.1    130.2030

#### map function - The map method is available for Pandas Series, not DataFrames.

In [82]:
df = pd.Series([3.356, 4.567])
df

0    3.356
1    4.567
dtype: float64

In [83]:
df.map(lambda x: len(str(x)))

0    5
1    5
dtype: int64

In [84]:
df.map(round)

0    3
1    5
dtype: int64

In [85]:
df.map(lambda x: x**2)

0    11.262736
1    20.857489
dtype: float64

In [86]:
#Vectorized
df = pd.DataFrame({'name':["Alice ", "Bob", "Charlie", None]})
df['clean']= df['name'].str.strip().str.lower()
df

      name    clean
0   Alice     alice
1      Bob      bob
2  Charlie  charlie
3     None     None

In [87]:
#Apply
df['apply_clean']= df['name'].apply(lambda x: x.strip().lower() if isinstance(x,str) else x)
df

      name    clean apply_clean
0   Alice     alice       alice
1      Bob      bob         bob
2  Charlie  charlie     charlie
3     None     None        None

In [88]:
#Map
df['map_clean']= df['name'].map(lambda x: x.strip().lower() if isinstance(x,str) else x)
df

      name    clean apply_clean map_clean
0   Alice     alice       alice     alice
1      Bob      bob         bob       bob
2  Charlie  charlie     charlie   charlie
3     None     None        None      None

### GroupBy & Aggregations

    groupby()
    Aggregations(sum,mean,count)
    Multiple Aggregations
    Resetting index

In [89]:
df = pd.DataFrame(
    {
        "Animal": ["Falcon", "Falcon", "Parrot", "Parrot"],
        "Max Speed": [380.0, 370.0, 24.0, 26.0],
    }
)
df

   Animal  Max Speed
0  Falcon      380.0
1  Falcon      370.0
2  Parrot       24.0
3  Parrot       26.0

In [90]:
df.groupby(["Animal"]).mean()

        Max Speed
Animal
Falcon      375.0
Parrot       25.0

In [91]:
arr = [[1, 2, 3], [1, None, 4], [2, 1, 3], [1, 2, 2]]
df = pd.DataFrame(arr, columns=["a", "b", "c"])
df.groupby(by=["b"]).sum()

     a  c
b
1.0  2  3
2.0  2  5

In [92]:
df.groupby(by="a").sum()

     b  c
a
1  4.0  9
2  1.0  3

In [93]:
import pandas as pd

data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi',
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'],
        'Age':[27, 24, 22, 32,
               33, 36, 27, 32],
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']}
df = pd.DataFrame(data1)
print(df)


df.groupby('Name')
print(df.groupby('Name').groups)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA
{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [94]:
gk = df.groupby('Name') 
gk.first()

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

In [95]:
df.groupby(['Name', 'Qualification'])
print(df.groupby(['Name', 'Qualification']).groups)

{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

In [96]:
df.groupby('Name')['Age'].sum()

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       49
Princi    59
Name: Age, dtype: int64

In [97]:
df.groupby(['Name'], sort=False)['Age'].sum()

Name
Jai       49
Anuj      60
Princi    59
Gaurav    33
Abhi      32
Name: Age, dtype: int64

In [98]:
df.groupby('Name').groups

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

In [99]:
grp = df.groupby('Name')
for name, group in grp:
    print(name)
    print(group)
    print()

Abhi
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

Anuj
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
5  Anuj   36  Kanpur         B.com

Gaurav
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

Jai
  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

Princi
     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc

In [100]:
grp = df.groupby(['Name', 'Qualification'])
for name, group in grp:
    print(name)
    print(group)
    print()

('Abhi', 'MA')
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

('Anuj', 'B.com')
   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com

('Anuj', 'MA')
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA

('Gaurav', 'B.Tech')
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

('Jai', 'MCA')
  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA

('Jai', 'Msc')
  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

('Princi', 'Msc')
     Name  Age    Address Qualification
6  Princi   27  Allahabad           Msc

('Princi', 'Phd')
     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

In [101]:
grp = df.groupby('Name')
grp.get_group('Jai')

  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

In [102]:
grp1 = df.groupby('Name')
grp1['Age'].aggregate(np.sum)

Name
Abhi      32
Anuj      60
Gaurav    33
Jai       49
Princi    59
Name: Age, dtype: int64

In [103]:
grp1 = df.groupby(['Name', 'Qualification'])
grp1['Age'].aggregate(np.sum)

Name    Qualification
Abhi    MA               32
Anuj    B.com            36
        MA               24
Gaurav  B.Tech           33
Jai     MCA              22
        Msc              27
Princi  Msc              27
        Phd              32
Name: Age, dtype: int64

In [104]:
grp = df.groupby('Name')
grp['Age'].agg([np.sum, np.mean, np.std])

        sum  mean       std
Name
Abhi     32  32.0       NaN
Anuj     60  30.0  8.485281
Gaurav   33  33.0       NaN
Jai      49  24.5  3.535534
Princi   59  29.5  3.535534

### Merge/Join

    merge() - inner(), outer(), left(), right()
    join on columns vs index
    concate

#### concate

In [105]:
import numpy as np
import pandas as pd
df1 = pd.DataFrame(
    {
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    },
    index=[0, 1, 2, 3],
)
df2 = pd.DataFrame(
    {
        "A": ["A4", "A5", "A6", "A7"],
        "B": ["B4", "B5", "B6", "B7"],
        "C": ["C4", "C5", "C6", "C7"],
        "D": ["D4", "D5", "D6", "D7"],
    },
    index=[4, 5, 6, 7],
)
df3 = pd.DataFrame(
    {
        "A": ["A8", "A9", "A10", "A11"],
        "B": ["B8", "B9", "B10", "B11"],
        "C": ["C8", "C9", "C10", "C11"],
        "D": ["D8", "D9", "D10", "D11"],
    },
    index=[8, 9, 10, 11],
)
frames = [df1, df2, df3]

result = pd.concat(frames)
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [106]:
df4 = pd.DataFrame(
    {
        "B": ["B2", "B3", "B6", "B7"],
        "D": ["D2", "D3", "D6", "D7"],
        "F": ["F2", "F3", "F6", "F7"],
    },
    index=[2, 3, 6, 7],
)
result = pd.concat([df1, df4], axis=1)

result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [107]:
result = pd.concat([df1, df4], axis=1, join="inner")
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [108]:
result = pd.concat([df1, df4], axis=1).reindex(df1.index)

result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [109]:
s1 = pd.Series(["X0", "X1", "X2", "X3"], name="X")

result = pd.concat([df1, s1], axis=1)

result

    A   B   C   D   X
0  A0  B0  C0  D0  X0
1  A1  B1  C1  D1  X1
2  A2  B2  C2  D2  X2
3  A3  B3  C3  D3  X3

In [110]:
result = pd.concat(frames, keys=["x", "y", "z"])

result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [111]:
result.loc["y"]

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

#### merge() - inner(), outer(), left(), right()

In [112]:
left = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "A": ["A0", "A1", "A2", "A3"],
        "B": ["B0", "B1", "B2", "B3"],
    }
)
right = pd.DataFrame(
    {
        "key": ["K0", "K1", "K2", "K3"],
        "C": ["C0", "C1", "C2", "C3"],
        "D": ["D0", "D1", "D2", "D3"],
    }
)
result = pd.merge(left, right, on="key")
result

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [113]:
left = pd.DataFrame(
   {
      "key1": ["K0", "K0", "K1", "K2"],
      "key2": ["K0", "K1", "K0", "K1"],
      "A": ["A0", "A1", "A2", "A3"],
      "B": ["B0", "B1", "B2", "B3"],
   }
)

right = pd.DataFrame(
   {
      "key1": ["K0", "K1", "K1", "K2"],
      "key2": ["K0", "K0", "K0", "K0"],
      "C": ["C0", "C1", "C2", "C3"],
      "D": ["D0", "D1", "D2", "D3"],
   }
)
result = pd.merge(left, right, how="left", on=["key1", "key2"])

result

  key1 key2   A   B    C    D
0   K0   K0  A0  B0   C0   D0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   C1   D1
3   K1   K0  A2  B2   C2   D2
4   K2   K1  A3  B3  NaN  NaN

In [114]:
result = pd.merge(left, right, how="right", on=["key1", "key2"])

result

  key1 key2    A    B   C   D
0   K0   K0   A0   B0  C0  D0
1   K1   K0   A2   B2  C1  D1
2   K1   K0   A2   B2  C2  D2
3   K2   K0  NaN  NaN  C3  D3

In [115]:
result = pd.merge(left, right, how="outer", on=["key1", "key2"])

result

  key1 key2    A    B    C    D
0   K0   K0   A0   B0   C0   D0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   C1   D1
3   K1   K0   A2   B2   C2   D2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   C3   D3

In [116]:
result = pd.merge(left, right, how="inner", on=["key1", "key2"])

result

  key1 key2   A   B   C   D
0   K0   K0  A0  B0  C0  D0
1   K1   K0  A2  B2  C1  D1
2   K1   K0  A2  B2  C2  D2

In [117]:
result = pd.merge(left, right, how="cross")

result

   key1_x key2_x   A   B key1_y key2_y   C   D
0      K0     K0  A0  B0     K0     K0  C0  D0
1      K0     K0  A0  B0     K1     K0  C1  D1
2      K0     K0  A0  B0     K1     K0  C2  D2
3      K0     K0  A0  B0     K2     K0  C3  D3
4      K0     K1  A1  B1     K0     K0  C0  D0
5      K0     K1  A1  B1     K1     K0  C1  D1
6      K0     K1  A1  B1     K1     K0  C2  D2
7      K0     K1  A1  B1     K2     K0  C3  D3
8      K1     K0  A2  B2     K0     K0  C0  D0
9      K1     K0  A2  B2     K1     K0  C1  D1
10     K1     K0  A2  B2     K1     K0  C2  D2
11     K1     K0  A2  B2     K2     K0  C3  D3
12     K2     K1  A3  B3     K0     K0  C0  D0
13     K2     K1  A3  B3     K1     K0  C1  D1
14     K2     K1  A3  B3     K1     K0  C2  D2
15     K2     K1  A3  B3     K2     K0  C3  D3

#### join on columns vs index

In [118]:
left = pd.DataFrame(
    {"A": ["A0", "A1", "A2"], "B": ["B0", "B1", "B2"]}, index=["K0", "K1", "K2"]
)

right = pd.DataFrame(
    {"C": ["C0", "C2", "C3"], "D": ["D0", "D2", "D3"]}, index=["K0", "K2", "K3"]
)

result = left.join(right)
result

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [119]:
result = left.join(right, how="outer")

result

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [120]:
result = left.join(right, how="inner")

result

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C2  D2

### String Operations

In [121]:
import numpy as np
import pandas as pd
s = pd.Series(
    ["A", "B", "C", "Aaba", np.nan, "dog", "cat"],
    dtype="str",
)
s

0       A
1       B
2       C
3    Aaba
4     NaN
5     dog
6     cat
dtype: object

In [122]:
print(s.str.lower())
print(s.str.upper())
print(s.str.len())

0       a
1       b
2       c
3    aaba
4     NaN
5     dog
6     cat
dtype: object
0       A
1       B
2       C
3    AABA
4     NaN
5     DOG
6     CAT
dtype: object
0    1.0
1    1.0
2    1.0
3    4.0
4    NaN
5    3.0
6    3.0
dtype: float64

In [123]:
print(s.str.cat(sep=","))

A,B,C,Aaba,dog,cat

In [124]:
s.str.cat()

'ABCAabadogcat'

In [125]:
u = pd.Series(["b", "d", "a", "c"], index=[1, 3, 0, 2], dtype="str")
u

1    b
3    d
0    a
2    c
dtype: object

In [126]:
s.str.cat(u)

0       Aa
1       Bb
2       Cc
3    Aabad
4      NaN
5      NaN
6      NaN
dtype: object

In [127]:
s.str.cat(u, join="left")

0       Aa
1       Bb
2       Cc
3    Aabad
4      NaN
5      NaN
6      NaN
dtype: object

In [128]:
s

0       A
1       B
2       C
3    Aaba
4     NaN
5     dog
6     cat
dtype: object

In [129]:
s.str[0]

0      A
1      B
2      C
3      A
4    NaN
5      d
6      c
dtype: object

In [130]:
s.str[2]

0    NaN
1    NaN
2    NaN
3      b
4    NaN
5      g
6      t
dtype: object

In [131]:
s = pd.Series(
    [
        "this is a regular sentence",
        "https://docs.python.org/3/tutorial/index.html",
        np.nan,
    ]
)
s

0                       this is a regular sentence
1    https://docs.python.org/3/tutorial/index.html
2                                              NaN
dtype: object

In [132]:
s.str.split()

0                   [this, is, a, regular, sentence]
1    [https://docs.python.org/3/tutorial/index.html]
2                                                NaN
dtype: object

In [133]:
s = pd.Series(["foojpgbar.jpg"])
s.str.split(r".", expand=True)

           0    1
0  foojpgbar  jpg

In [134]:
s1 = pd.Series(["Mouse", "dog", "house and parrot", "23", np.nan])
s1.str.contains("og", regex=False)

0    False
1     True
2    False
3    False
4      NaN
dtype: object

In [135]:
s2=pd.Series(["foo", "fuz", np.nan]).str.replace("f.", "ba", regex=True)
s2

0    bao
1    baz
2    NaN
dtype: object

In [136]:
s = pd.Series(["koala", "dog", "chameleon"])
s.str.slice(start=1)

0        oala
1          og
2    hameleon
dtype: object

In [137]:
s.str.slice(start=0, stop=5, step=3)

0    kl
1     d
2    cm
dtype: object

### Data and Time Basic

    Convert to datetime
    Extract year,month,day
    Simple filtering by date

#### Convert to datetime

In [138]:
s = pd.Series(["1/1/2020 10:00:00+00:00", "2/1/2020 11:00:00+00:00"])
s = pd.to_datetime(s)
s

0   2020-01-01 10:00:00+00:00
1   2020-02-01 11:00:00+00:00
dtype: datetime64[ns, UTC]

In [139]:
idx = pd.DatetimeIndex(
    ["1/1/2020 10:00:00+00:00", "2/1/2020 11:00:00+00:00"]
)
idx.date

array([datetime.date(2020, 1, 1), datetime.date(2020, 2, 1)], dtype=object)

In [140]:
s = pd.Series(["1/1/2020 10:00:00+00:00", "2/1/2020 11:00:00+00:00"])
s = pd.to_datetime(s)
s

0   2020-01-01 10:00:00+00:00
1   2020-02-01 11:00:00+00:00
dtype: datetime64[ns, UTC]

#### Extract year,month,day

In [141]:
datetime_series = pd.Series(
    pd.date_range("2000-01-01", periods=3, freq="Y")
)
datetime_series.dt.year

0    2000
1    2001
2    2002
dtype: int64

In [142]:
s.dt.time

0    10:00:00
1    11:00:00
dtype: object

In [143]:
datetime_series = pd.Series(
    pd.date_range("2000-01-01", periods=3, freq="M")
)
datetime_series.dt.month

0    1
1    2
2    3
dtype: int64

In [144]:
datetime_series

0   2000-01-31
1   2000-02-29
2   2000-03-31
dtype: datetime64[ns]

In [145]:
import pandas as pd

# Create a date range
dates = pd.date_range(start="2020-01-01", end="2023-12-31", freq="Y")

# Extract the year from the DatetimeIndex
years = dates.year

print("Date Range:", dates)
print("Years:", years)

Date Range: DatetimeIndex(['2020-12-31', '2021-12-31', '2022-12-31', '2023-12-31'], dtype='datetime64[ns]', freq='A-DEC')
Years: Int64Index([2020, 2021, 2022, 2023], dtype='int64')

In [146]:
import pandas as pd  # Required import

# Example usage
dates = pd.date_range(start="2024-01-01", end="2024-01-10", freq="D")
print(dates)

DatetimeIndex(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-04',
               '2024-01-05', '2024-01-06', '2024-01-07', '2024-01-08',
               '2024-01-09', '2024-01-10'],
              dtype='datetime64[ns]', freq='D')

In [147]:
datetime_series = pd.Series(
    pd.date_range("2000-01-01", periods=3, freq="h")
)
print(datetime_series)
datetime_series.dt.hour

0   2000-01-01 00:00:00
1   2000-01-01 01:00:00
2   2000-01-01 02:00:00
dtype: datetime64[ns]

0    0
1    1
2    2
dtype: int64

In [148]:
datetime_series = pd.Series(
    pd.date_range("2000-01-01", periods=3, freq="min")
)
print(datetime_series)
datetime_series.dt.minute

0   2000-01-01 00:00:00
1   2000-01-01 00:01:00
2   2000-01-01 00:02:00
dtype: datetime64[ns]

0    0
1    1
2    2
dtype: int64

In [149]:
datetime_series = pd.Series(
    pd.date_range("2000-01-01", periods=3, freq="s")
)
print(datetime_series)
datetime_series.dt.second

0   2000-01-01 00:00:00
1   2000-01-01 00:00:01
2   2000-01-01 00:00:02
dtype: datetime64[ns]

0    0
1    1
2    2
dtype: int64

#### Simple filtering by date

In [150]:
import pandas as pd

# Sample data
data = {
    'date': ['2024-01-01', '2024-02-15', '2024-03-10', '2024-04-05'],
    'value': [10, 20, 30, 40]
}

df = pd.DataFrame(data)

# Convert 'date' column to datetime
df['date'] = pd.to_datetime(df['date'])

# Example 1: Filter rows after a specific date
start_date = '2024-02-01'
filtered_df = df[df['date'] > start_date]

print("After 2024-02-01:")
print(filtered_df)

# Example 2: Filter between two dates
start_date = '2024-02-01'
end_date = '2024-03-31'
between_df = df[(df['date'] >= start_date) & (df['date'] <= end_date)]

print("\nBetween 2024-02-01 and 2024-03-31:")
print(between_df)

After 2024-02-01:
        date  value
1 2024-02-15     20
2 2024-03-10     30
3 2024-04-05     40

Between 2024-02-01 and 2024-03-31:
        date  value
1 2024-02-15     20
2 2024-03-10     30

### File Handling

    read_csv()
    read_excel()
    to_csv()
    to_excel()

In [151]:
df = pd.DataFrame(
    [["Raphael", "red", "sai"], ["Donatello", "purple", "bo staff"]],
    columns=["name", "mask", "weapon"],
)
df.to_csv("out.csv", index=False)

In [152]:
import pandas as pd
pd.read_csv("out.csv")

        name    mask    weapon
0    Raphael     red       sai
1  Donatello  purple  bo staff

In [153]:
df1 = pd.DataFrame(
    [["a", "b"], ["c", "d"]],
    index=["row 1", "row 2"],
    columns=["col 1", "col 2"],
)
df1.to_excel("output.xlsx")

In [154]:
df1.to_excel("output.xlsx", sheet_name="Sheet_name_1")

In [155]:
pd.read_excel("output.xlsx", index_col=0)

      col 1 col 2
row 1     a     b
row 2     c     d

In [156]:
pd.read_excel("output.xlsx", index_col=None, header=None)

       0      1      2
0    NaN  col 1  col 2
1  row 1      a      b
2  row 2      c      d